let handler = async m => m.reply(`
★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆
≡★☆ⓂⓄⓈⒽⒾⓇⒺⓕ 🅣🅗🅔 ⓄⓌⓃⒺⓇ☆★≡

★𝚂𝚄𝙿𝙿𝙾®𝚃 𝙻𝙸𝙽𝙺★
─────────────
▢ ★☆☆🛡️𝗢𝗦𝗛𝗜𝗥𝗘𝗙ᴍ-𝗕𝗢𝗧🛡️☆☆★

🅛🅘🅝🅚: https://wa.me/201022647804

🅛🅘🅝🅚: https://www.facebook.com/profile.php?id=100009554691220&mibextid=ZbWKwL

★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★
★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆
 
★   ☆   ★   ☆   ★   ☆   ★   ☆
┊   ┊　　┊　　┊　　┊
┊   ┊　　┊　　┊　　★
┊   ┊　　┊　　☆
┊   ┊　　★
┊   ☆
★${developer}★
★☆🅞🅦🅝🅔🅡 🅝🅤🅜🅑🅔🅡☆★
★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★
`.trim())
handler.help = ['gpprince']
handler.tags = ['main']
handler.command = ['groups', 'groupprince', 'gugp', 'ggp', 'support'] 

export default handler
